xrun(64): 23.09-s002: (c) Copyright 1995-2023 Cadence Design Systems, Inc.
TOOL:	xrun(64)	23.09-s002: Started on Feb 09, 2024 at 03:18:50 EST
xrun
	-f xrunArgs
		-UNBUFFERED
		-cdslib ./cds.lib
		-errormax 50
		-status
		-nowarn DLNOHV
		-nowarn DLCLAP
		-v93
		-incdir /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/
		-ade
		-timescale 1ns/1ns
		-vtimescale 1ns/1ns
		-discipline logic
		-delay_mode None
		-novitalaccl
		-access r
		-noparamerr
		-amspartinfo ../psf/partition.info
		-rnm_partinfo
		-modelincdir /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/
		./spiceModels.scs
		./amsControlSpectre.scs
		-input ./probe.tcl
		-run
		-exit
		-xmsimargs "+amsrawdir ../psf"
		-spectre_args "-ahdllibdir /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.24/sharedData/CDS/ahdl/input.ahdlSimDB"
		-spectre_args +logstatus
		-simcompatible_ams spectre
		-name TOP.top_tb:config
		-amsconnrules ConnRules_3V_full_fast
		+define+CDS_SELECT_CRS
		+define+CONNRULES_3V_FULL_FAST
		-allowredefinition
		-amsbind
		-top TOP.top_tb:schematic
		-top cds_globals
		./netlist.vams
		-f ./textInputs
			-amscompilefile "file:/home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/COUNTER_JI3/counter_stimulus/verilogams/verilog.vams lib:COUNTER_JI3 cell:counter_stimulus view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/APR00DPC/verilogams/verilog.vams lib:IO_CELLS_JIC3V cell:APR00DPC view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/x_all/diglibs/VLG_PRIMITIVES/v1_2/cadence_IC61/v1_2_0/VLG_PRIMITIVES/resistor_ams/verilogams/verilog.vams lib:VLG_PRIMITIVES cell:resistor_ams view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/PWRCUTDCPC/verilogams/verilog.vams lib:IO_CELLS_JIC3V cell:PWRCUTDCPC view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/x_all/diglibs/VLG_PRIMITIVES/v1_2/cadence_IC61/v1_2_0/VLG_PRIMITIVES/check_vdd/verilogams/verilog.vams lib:VLG_PRIMITIVES cell:check_vdd view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/x_all/diglibs/VLG_PRIMITIVES/v1_2/cadence_IC61/v1_2_0/VLG_PRIMITIVES/check_gnd/verilogams/verilog.vams lib:VLG_PRIMITIVES cell:check_gnd view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/GNDPADPC/verilogams/verilog.vams lib:IO_CELLS_JIC3V cell:GNDPADPC view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/PSUBPADPC/verilogams/verilog.vams lib:IO_CELLS_JIC3V cell:PSUBPADPC view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/GNDORPADPC/verilogams/verilog.vams lib:IO_CELLS_JIC3V cell:GNDORPADPC view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/VDDPADPC/verilogams/verilog.vams lib:IO_CELLS_JIC3V cell:VDDPADPC view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/VDDORPADPC/verilogams/verilog.vams lib:IO_CELLS_JIC3V cell:VDDORPADPC view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/ICPC/verilogams/verilog.vams lib:IO_CELLS_JIC3V cell:ICPC view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/BT4PC/verilogams/verilog.vams lib:IO_CELLS_JIC3V cell:BT4PC view:verilogams"
			-amscompilefile "file:/home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/APR04DPC/verilogams/verilog.vams lib:IO_CELLS_JIC3V cell:APR04DPC view:verilogams"
			-makelib TOP
			-makelib INV_HV
			-makelib INV_LP
			-makelib IORING
			-makelib HV_CELLS
			-endlib
		-v /home/saul/projects/XH018_mixed_ji3/test_mix/src/VLG_PRIMITIVES.v
		-v /home/saul/projects/XH018_mixed_ji3/test_mix/src/D_CELLS_JI3V.v
		./cds_globals.vams
		-l ../psf/xrun.log
		-spectre_args ++aps
file: ./netlist.vams
	module COUNTER_JI3.counter:schematic
		errors: 0, warnings: 0
	module HV_CELLS.HVDD4DJ5PKFs:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_d2pk:schematic
		errors: 0, warnings: 0
	module HV_CELLS.HVDD4D2PK:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_iscrd2_4x100:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pe3isab_15_04:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pe3isabhv_1050gcr:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pmbsab_15_10:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pmbsabhv_750:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_c5pk:schematic
		errors: 0, warnings: 0
	module HV_CELLS.HVD4SJD1R5PKFs:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_dhpw_2x100:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_dhpw_2x100_stack3:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pmbsab_40_10:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pmbsabhv_2000:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pe3isab_40_04:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pe3isabhv_2800gcr:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_d5pk:schematic
		errors: 0, warnings: 0
	module IORING.ioring:schematic
		errors: 0, warnings: 0
	module INV_LP.inv:schematic
		errors: 0, warnings: 0
	module INV_HV.inv_hv:schematic
		errors: 0, warnings: 0
	module TOP.top:schematic
		errors: 0, warnings: 0
	module TOP.top_tb:schematic
		errors: 0, warnings: 0
file: ./cds_globals.vams
	module worklib.cds_globals:vams
		errors: 0, warnings: 0
file: /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/COUNTER_JI3/counter_stimulus/verilogams/verilog.vams
	module COUNTER_JI3.counter_stimulus:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/APR00DPC/verilogams/verilog.vams
	module IO_CELLS_JIC3V.APR00DPC:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/x_all/diglibs/VLG_PRIMITIVES/v1_2/cadence_IC61/v1_2_0/VLG_PRIMITIVES/resistor_ams/verilogams/verilog.vams
	module VLG_PRIMITIVES.resistor_ams:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/PWRCUTDCPC/verilogams/verilog.vams
	module IO_CELLS_JIC3V.PWRCUTDCPC:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/x_all/diglibs/VLG_PRIMITIVES/v1_2/cadence_IC61/v1_2_0/VLG_PRIMITIVES/check_vdd/verilogams/verilog.vams
	module VLG_PRIMITIVES.check_vdd:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/x_all/diglibs/VLG_PRIMITIVES/v1_2/cadence_IC61/v1_2_0/VLG_PRIMITIVES/check_gnd/verilogams/verilog.vams
	module VLG_PRIMITIVES.check_gnd:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/GNDPADPC/verilogams/verilog.vams
	module IO_CELLS_JIC3V.GNDPADPC:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/PSUBPADPC/verilogams/verilog.vams
	module IO_CELLS_JIC3V.PSUBPADPC:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/GNDORPADPC/verilogams/verilog.vams
	module IO_CELLS_JIC3V.GNDORPADPC:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/VDDPADPC/verilogams/verilog.vams
	module IO_CELLS_JIC3V.VDDPADPC:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/VDDORPADPC/verilogams/verilog.vams
	module IO_CELLS_JIC3V.VDDORPADPC:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/ICPC/verilogams/verilog.vams
	module IO_CELLS_JIC3V.ICPC:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/BT4PC/verilogams/verilog.vams
	module IO_CELLS_JIC3V.BT4PC:verilogams
		errors: 0, warnings: 0
file: /home/saul/pkg/xfab/XKIT/xh018/diglibs/IO_CELLS_JIC3V/v1_0/cadence_IC61/v1_0_0/IO_CELLS_JIC3V/APR04DPC/verilogams/verilog.vams
	module IO_CELLS_JIC3V.APR04DPC:verilogams
		errors: 0, warnings: 0
file: /home/saul/projects/XH018_mixed_ji3/test_mix/src/VLG_PRIMITIVES.v
	primitive VLG_PRIMITIVES_1.check_buf:v
		errors: 0, warnings: 0
file: /home/saul/projects/XH018_mixed_ji3/test_mix/src/D_CELLS_JI3V.v
	module v2_1_0.AN21JI3VX1:v
		errors: 0, warnings: 0
	module v2_1_0.AN22JI3VX1:v
		errors: 0, warnings: 0
	module v2_1_0.BUJI3VX0:v
		errors: 0, warnings: 0
	module v2_1_0.BUJI3VX1:v
		errors: 0, warnings: 0
	module v2_1_0.BUJI3VX16:v
		errors: 0, warnings: 0
	module v2_1_0.BUJI3VX2:v
		errors: 0, warnings: 0
	module v2_1_0.DFRQJI3VX1:v
		errors: 0, warnings: 0
	module v2_1_0.DFRQJI3VX2:v
		errors: 0, warnings: 0
	module v2_1_0.DFRQJI3VX4:v
		errors: 0, warnings: 0
	module v2_1_0.DLY1JI3VX1:v
		errors: 0, warnings: 0
	module v2_1_0.DLY2JI3VX1:v
		errors: 0, warnings: 0
	module v2_1_0.EN2JI3VX0:v
		errors: 0, warnings: 0
	module v2_1_0.INJI3VX0:v
		errors: 0, warnings: 0
	module v2_1_0.NA2JI3VX0:v
		errors: 0, warnings: 0
	module v2_1_0.NO2JI3VX0:v
		errors: 0, warnings: 0
	module v2_1_0.ON211JI3VX1:v
		errors: 0, warnings: 0
	module v2_1_0.DECAP10JI3V:v
		errors: 0, warnings: 0
	module v2_1_0.DECAP15JI3V:v
		errors: 0, warnings: 0
	module v2_1_0.DECAP25JI3V:v
		errors: 0, warnings: 0
	module v2_1_0.DECAP5JI3V:v
		errors: 0, warnings: 0
	module v2_1_0.DECAP7JI3V:v
		errors: 0, warnings: 0
file: /home/saul/projects/XH018_mixed_ji3/test_mix/src/VLG_PRIMITIVES.v
	primitive VLG_PRIMITIVES_1.u1_fd5:v
		errors: 0, warnings: 0
xmvlog: *W,SPDUSD: Include directory /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/ given but not used.
	Total errors/warnings found outside modules and primitives:
		errors: 0, warnings: 1
xmvlog: Memory Usage - Current physical: 23.1M, Current virtual: 60.7M
xmvlog: CPU Usage - 0.0s system + 0.1s user = 0.1s total (0.1s, 47.9% cpu)
AMSD Universal Connect Module UCM is enabled.
		Caching library 'COUNTER_JI3' ....... Done
		Caching library 'HV_CELLS' ....... Done
		Caching library 'INV_HV' ....... Done
		Caching library 'INV_LP' ....... Done
		Caching library 'IORING' ....... Done
		Caching library 'IO_CELLS_JIC3V' ....... Done
		Caching library 'TOP' ....... Done
		Caching library 'VLG_PRIMITIVES' ....... Done
		Caching library 'VLG_PRIMITIVES_1' ....... Done
		Caching library 'v2_1_0' ....... Done
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
xmelab: *N,MSFLON: Xcelium will initiate mixed signal elaboration, Reason: Verilog AMS module.
		Caching library 'v2_1_0' ....... Done
		Caching library 'VLG_PRIMITIVES_1' ....... Done
	Top level design units:
		top_tb
		cds_globals
	Discipline resolution Pass...
	Doing auto-insertion of connection elements...
	Connect Rules applied are:
		ConnRules_3V_full_fast
	Building instance overlay tables: .................... Done
	Using implicit TMP libraries; associated with library TOP
	Generating native compiled code:
		VLG_PRIMITIVES.check_vdd:verilogams <0x70e153df>
			streams:   1, words:   152
		VLG_PRIMITIVES.check_gnd:verilogams <0x6cac9861>
			streams:   1, words:   152
		v2_1_0.DFRQJI3VX4:v <0x45402cb8>
			streams:   0, words:     0
		v2_1_0.ON211JI3VX1:v <0x30c5f889>
			streams:   0, words:     0
		v2_1_0.ON211JI3VX1:v <0x35caf646>
			streams:   0, words:     0
		v2_1_0.AN21JI3VX1:v <0x658d7ff9>
			streams:   0, words:     0
		v2_1_0.AN22JI3VX1:v <0x7c939125>
			streams:   0, words:     0
		v2_1_0.DFRQJI3VX2:v <0x2261b02b>
			streams:   0, words:     0
		v2_1_0.EN2JI3VX0:v <0x20e0584d>
			streams:   0, words:     0
		v2_1_0.EN2JI3VX0:v <0x0d5bbe06>
			streams:   0, words:     0
		v2_1_0.DFRQJI3VX1:v <0x0a01da8a>
			streams:   0, words:     0
		COUNTER_JI3.counter_stimulus:verilogams <0x0b61f62b>
			streams:   2, words:  1765
		connectLib.L2E_2:module <0x00fd49c8>
			streams:  15, words:  8739
		connectLib.Bidir_2:module <0x41df3656>
			streams:  29, words: 20986
		connectLib.E2L_2:module <0x7c69a884>
			streams:  24, words: 12794
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:               865      77
		UDPs:                   20       2
		Primitives:            103       9
		Timing outputs:         65      15
		Registers:             296     245
		Scalar wires:          176       -
		Vectored wires:         13       -
		Always blocks:         147      77
		Initial blocks:        157     121
		Cont. assignments:      49      23
		Pseudo assignments:     24       -
		Timing checks:          48       9
		Interconnect:          702       -
		Simulation timescale:  1ps
	Writing initial simulation snapshot: TOP.top_tb:config
xmelab: Memory Usage - Final: 57.8M, Peak: 225.7M, Peak virtual: 340.2M
xmelab: CPU Usage - 0.1s system + 0.2s user = 0.3s total (0.3s, 73.9% cpu)
Loading snapshot TOP.top_tb:config .................... Done
Simulating in AMS-SIE mode...
	Starting analog simulation engine...
AMSD Flexible Release Matrix --- using Spectre from installation:
    /pkg/cadence/installs/SPECTRE231/tools/bin/spectre
AMSD: Using spectre solver with arguments: -ahdllibdir /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.24/sharedData/CDS/ahdl/input.ahdlSimDB +logstatus ++aps.
xcelium> source /pkg/cadence/installs/XCELIUM2309/tools/xcelium/files/xmsimrc
xcelium> source /pkg/cadence/installs/XCELIUM2309/tools/xcelium/files/amsrc
xcelium> 
xcelium> # This is the NC-SIM(R) probe command file
xcelium> # used in the AMS-ADE integration.
xcelium> 
xcelium> 
xcelium> #
xcelium> # Database settings
xcelium> #
xcelium> if { [info exists ::env(AMS_RESULTS_DIR) ] } { set AMS_RESULTS_DIR $env(AMS_RESULTS_DIR)} else {set AMS_RESULTS_DIR "../psf"}
../psf
xcelium> database -open ams_database -into ${AMS_RESULTS_DIR} -default
Created default SHM database ams_database
xcelium> 
xcelium> #
xcelium> # Probe settings
xcelium> #
xcelium> probe -create -emptyok -database ams_database {top_tb.clk}
Created probe 1
xcelium> probe -create -emptyok -database ams_database {top_tb.enable}
Created probe 2
xcelium> probe -create -emptyok -database ams_database {top_tb.reset}
Created probe 3
xcelium> probe -create -emptyok -database ams_database {top_tb.out_l}
Created probe 4
xcelium> probe -create -emptyok -database ams_database {top_tb.out_h}
Created probe 5
xcelium> probe -create -emptyok -database ams_database {top_tb.out2}
Created probe 6
xcelium> probe -create -emptyok -database ams_database {top_tb.out1}
Created probe 7
xcelium> probe -create -emptyok -database ams_database {top_tb.out0}
Created probe 8
xcelium> probe -create -emptyok -database ams_database {top_tb.I0.out[2]}
Created probe 9
xcelium> probe -create -emptyok -database ams_database {top_tb.VDDHV}
Created probe 10
xcelium> probe -create -emptyok -database ams_database {top_tb.net7}
Created probe 11
xcelium> probe -create -emptyok -database ams_database -flow {top_tb.I0.I2.VDDHV}
Created probe 12
xcelium> probe -create -emptyok -database ams_database -flow {top_tb.I0.I0.I24.PAD}
Created probe 13
xcelium> probe -create -emptyok -database ams_database -flow {top_tb.I0.I0.I33.PAD}
Created probe 14
xcelium> 
xcelium> run

Spectre (R) Circuit Simulator
Version 23.1.0.305.isr3 64bit -- 13 Nov 2023
Copyright (C) 1989-2023 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence and Spectre are registered trademarks of Cadence Design Systems, Inc. All others are the property of their respective holders.

Includes RSA BSAFE(R) Cryptographic or Security Protocol Software from RSA Security, Inc.

User: saul   Host: phoenix   HostID: A0F02   PID: 12657
Memory  available: 14.9883 GB  physical: 16.6560 GB
Linux   : CentOS Linux release 7 (Core)
CPU Type: 11th Gen Intel(R) Core(TM) i7-11700K @ 3.60GHz
All processors running at 3600.0 MHz
        Socket: Processors
        0:       0,  1,  2,  3,  4,  5
        
System load averages (1min, 5min, 15min) : 1.2 %, 2.3 %, 2.3 %
HPC is enabled


Simulating `spiceModels.ams' on phoenix at 3:19:00 AM, Fri Feb 9, 2024 (process id: 12657).
Current working directory: /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.24/1/TOP:top_tb:1/netlist
Command line:
    /pkg/cadence/installs/SPECTRE231/tools/bin/spectre -64  \
        spiceModels.ams +config  \
        /pkg/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/configs/ams.cfg  \
        -ahdllibdir  \
        /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.24/sharedData/CDS/ahdl/input.ahdlSimDB  \
        +logstatus ++aps -raw ../psf  \
        -I/home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/  \
        +ams_control=xcelium.d/AMSD/ams_ctrl/ams_ctrl_12364_phoenix
Spectre Licensing Information:
Spectre [03:19:00.512361] Configured Lic search path (22.01-s002): 3000@lic08.ug.kth.se

Spectre Licensing Information:
Spectre [03:19:00.301721] Periodic Lic check successful

Loading /pkg/cadence/installs/SPECTRE231/tools.lnx86/cmi/lib/64bit/5.0/libinfineon_sh.so ...
Loading /pkg/cadence/installs/SPECTRE231/tools.lnx86/cmi/lib/64bit/5.0/libphilips_I_sh.so ...
Loading /pkg/cadence/installs/SPECTRE231/tools.lnx86/cmi/lib/64bit/5.0/libphilips_sh.so ...
Loading /pkg/cadence/installs/SPECTRE231/tools.lnx86/cmi/lib/64bit/5.0/libsparam_sh.so ...
Loading /pkg/cadence/installs/SPECTRE231/tools.lnx86/cmi/lib/64bit/5.0/libstmodels_sh.so ...
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.24/1/TOP:top_tb:1/netlist/spiceModels.ams

Notice from spectre during circuit read-in.
    Configuration file used: `/pkg/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/configs/ams.cfg'.

Reading link:  /pkg/cadence
Reading file:  /home/saul/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/configs/spectre.cfg
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.24/sharedData/CDS/ahdl/input.ahdlSimDB/VLG_PRIMITIVES__resistor_ams__verilogams__0x10000001_behavioral.flex.va
Reading file:  /home/saul/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/ahdl/constants.vams
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.24/sharedData/CDS/ahdl/input.ahdlSimDB/connectLib__E2L_2__module__0x10000001_behavioral.flex.va
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.24/sharedData/CDS/ahdl/input.ahdlSimDB/connectLib__Bidir_2__module__0x10000001_behavioral.flex.va
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.24/sharedData/CDS/ahdl/input.ahdlSimDB/connectLib__L2E_2__module__0x10000001_behavioral.flex.va
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.24/1/TOP:top_tb:1/netlist/spiceModels.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/config.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/param.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/bip.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/tm_bip.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpva.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpva3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvb3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvc3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnva.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvb_npn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvb_pnp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvc_npn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvc_pnp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvhscr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvascr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvhbscr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvba.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvba_npn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvba_pnp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvca.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvca_npn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvca_pnp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpv_pa.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpv_pb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpv_pc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpv_pd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpv_pe.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpv_pf.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpl_pa.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpl_pb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpl_pc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpl_pd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpl_pe.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpl_pf.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnl_pa.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnl_pb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnl_pc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnl_pd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnl_pe.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnl_pf.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/cap.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/tm_cap.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csandwt3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csandwt4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csandwt5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf2p.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf3p.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csft4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csft5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csft6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf3a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf4a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf5a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csft4a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csft5a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csft6a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cif3a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cif4a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cif5a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cift4a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cift5a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cift6a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmm3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmm4t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmm4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmm5t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmm6t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cdmm4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cdmm4t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/ctmm5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/ctmm5t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmmh3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmmh4t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmmh4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmmh5t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmmh6t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cdmmh4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cdmmh4t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/ctmmh5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/ctmmh5t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc_pmos.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvci.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvci_nmos.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvci_m.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc3_pmos.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc3i.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc3i_nmos.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc3i_m.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cpod.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cpod_i.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cpodhv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cpodhv_i.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cp1sub.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cp1suba.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cp1subp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/tag_25v.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/tag_60v.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/dio.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/tm_dio.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dn3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnn3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dp3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnw3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/ddnwmv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpdnwmv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dipdnwmv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/ddnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpdnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dipdnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnhpw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnhpwa.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dphnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dphnwa.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dhpw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dhnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dndf.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpdwhn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dwhn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpwhn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpndf.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpdddnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/ddpldnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dn3dpl.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dbn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpol.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnpdd_scr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpdd_scr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dsb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dsba.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dsba_qp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnp20.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpp20.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dn3sci.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dscidnwmv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/mos.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/tm_mos.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nei.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nei_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nei_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pei.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pei_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pei_m_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nel.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/neli.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/neli_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/neli_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pel.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pel_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/peli.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/peli_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/peli_m_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nn3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3i.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3i_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3i_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3i.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3i_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3i_m_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3ln.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3ln_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lni.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lni_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lni_m_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3_mos1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3i.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3i_mos1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3i_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3i_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3i_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nelna.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nelnai.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nelnai_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nelnai_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3lna.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3lnai.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3lnai_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3lnai_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lna.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lna_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lnai.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lnai_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lnai_m_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmma.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/jf_nmma.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmma_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmma.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/jf_pmma.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmma_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nedi.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nedi_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nedia.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nedia_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ped2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ped2_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ped.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ped_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhv_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhv_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhhv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhhv_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhhv_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmmc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmmc_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmmc_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmmd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmmd_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmmd_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmc_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmc_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nma.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nma_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/phv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/phv_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/phv_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/phhv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/phhv_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/phhv_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmc_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmc_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmmc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmmc_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmmc_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pma.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pma_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nesvt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nesvti.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nesvti_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nesvti_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pesvt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pesvt_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pesvti.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pesvti_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pesvti_m_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhvd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhvd_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhhvd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhhvd_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/photo.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/tm_pho.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphoa.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dpho.va
Reading link:  /pkg/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/ahdl/constants.h
Reading link:  /pkg/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/ahdl/discipline.h
Reading file:  /home/saul/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/ahdl/disciplines.vams
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphob.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphoc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/iphoto_uv.va
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphoc_cat.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphoc0.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphoc0_cat.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphocfp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphocfp_cat.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphod.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphod_an1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphod_an2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphod0.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphod0_an1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphod0_an2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphodfp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphodfp_an1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphodfp_an2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspada0.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/ispad.va
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/iphoto_apd_trig.va
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapb_jun.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapb_trig.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapb0.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapb0_jun.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/ispad_trig.va
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspb_jun.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspb_trig.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspb0.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspb0_jun.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspbfep.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapda.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/iphoto_apd.va
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapda_cat.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapda0.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspada.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspada_cat.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/res.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/tm_res.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdn_esd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdp_io.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdp_esd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnw_scr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdn3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdp3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnw3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnw3_scr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdnwmv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnp1_3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rpp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rpp1_3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rpp1s.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rpp1s_3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnp1h.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnp1h_3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rpp1k1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rpp1k1_3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rctdn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rctdp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rctp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsildn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsildp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsilnp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsilpp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbdn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbdp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbdn3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbdp3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbnp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbpp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbpp1k1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rm1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rm2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rm3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rm4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rm5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rmtp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rmtpl.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/pfuse.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/s_res.scs
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.24/1/TOP:top_tb:1/netlist/amsControlSpectre.scs
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.24/1/TOP:top_tb:1/netlist/.amsbind.scs
Reading file:  /home/saul/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/configs/ams.cfg
Time for NDB Parsing: CPU = 215.342 ms, elapsed = 935.871 ms.
Time accumulated: CPU = 258.958 ms, elapsed = 935.874 ms.
Peak resident memory used = 116 Mbytes.

Existing shared object for module connectLib__L2E_2__module__0x10000001_behavioral is up to date.
Installed compiled interface for connectLib__L2E_2__module__0x10000001_behavioral.
Existing shared object for module VLG_PRIMITIVES__resistor_ams__verilogams__0x10000001_behavioral is up to date.
Installed compiled interface for VLG_PRIMITIVES__resistor_ams__verilogams__0x10000001_behavioral.
Existing shared object for module connectLib__Bidir_2__module__0x10000001_behavioral_c2_0_c0_0_c1_1 is up to date.
Installed compiled interface for connectLib__Bidir_2__module__0x10000001_behavioral_c2_0_c0_0_c1_1.
Existing shared object for module connectLib__E2L_2__module__0x10000001_behavioral_c1_0_c2_0_c0_1 is up to date.
Installed compiled interface for connectLib__E2L_2__module__0x10000001_behavioral_c1_0_c2_0_c0_1.
Existing shared object for module bsource_ee103d is up to date.
Installed compiled interface for bsource_ee103d.
Existing shared object for module bsource_b7022a is up to date.
Installed compiled interface for bsource_b7022a.
Existing shared object for module bsource_rdp3mod_aaacb8 is up to date.
Installed compiled interface for bsource_rdp3mod_aaacb8.
Existing shared object for module bsource_d312da is up to date.
Installed compiled interface for bsource_d312da.
Existing shared object for module bsource_cf985e is up to date.
Installed compiled interface for bsource_cf985e.
Existing shared object for module bsource_rpp1k1_3mod_29a82c is up to date.
Installed compiled interface for bsource_rpp1k1_3mod_29a82c.
Time for Elaboration: CPU = 82.532 ms, elapsed = 108.915 ms.
Time accumulated: CPU = 341.573 ms, elapsed = 1.04487 s.
Peak resident memory used = 135 Mbytes.


Notice from spectre during hierarchy flattening.
    The value 'psf' specified for the 'checklimitdest' option will no longer be supported in future releases. Use 'spectre -h' to see other recommended values for the 'checklimitdest' option.


Time for EDB Visiting: CPU = 76.946 ms, elapsed = 76.9489 ms.
Time accumulated: CPU = 418.621 ms, elapsed = 1.12192 s.
Peak resident memory used = 150 Mbytes.


Warning from spectre during initial setup.
    WARNING (CMI-2318): top_tb.I0.I0.I24.I11.I5.MP_1_turbo_m70.MPX.m1: Parasitic resistor `rs' has been deleted because its value of 626.786 uOhm ( R / MFactor ) was smaller than `minr'.
    WARNING (CMI-2318): top_tb.I0.I0.I24.I11.I5.MP_1_turbo_m70.MPX.m1: Parasitic resistor `rd' has been deleted because its value of 626.786 uOhm ( R / MFactor ) was smaller than `minr'.
Notice from spectre during initial setup.
    top_tb.I0.I2.M0.nediamod: Hisim_hv version 2.10 used. Version: 2, Subversion: 1 and Revision: 0. Type is N.
Notice from spectre during topology check.
    No connections to node `top_tb.I0.out[0]'.
    No connections to node `top_tb.I0.out[1]'.
    No DC path from node `top_tb.I0.out[0]' to ground, Gmin installed to provide path.
    No DC path from node `top_tb.I0.out[1]' to ground, Gmin installed to provide path.


Global user options:
               temp = 27
            vabstol = 1e-06
            iabstol = 1e-12
               gmin = 1e-12
             rforce = 1
           maxnotes = 5
           maxwarns = 5
             digits = 5
             pivrel = 0.001
     checklimitdest = psf
             rawfmt = sst2
               save = selected
               tnom = 27
              scale = 1
             scalem = 1
             reltol = 0.001

Scoped user options:

Circuit inventory:
              nodes 6600
            bsim3v3 662   
     bsource_b7022a 210   
     bsource_cf985e 1     
     bsource_d312da 1     
     bsource_ee103d 210   
bsource_rdp3mod_aaacb8 420   
bsource_rpp1k1_3mod_29a82c 2     
          capacitor 30    
connectLib__L2E_2__module__0x10000001_behavioral 1     
              diode 2565  
           hisim_hv 1     
          juncap200 2565  
           resistor 6091  
VLG_PRIMITIVES__resistor_ams__verilogams__0x10000001_behavioral 1     
            vsource 11    
connectLib__Bidir_2__module__0x10000001_behavioral 6     
connectLib__E2L_2__module__0x10000001_behavioral 6     

Analysis and control statement inventory:
                 dc 1     
               info 5     
               tran 1     

Output statements:
             .probe 0     
           .measure 0     
               save 9     


Notice from spectre during initial setup.
    7 vsources are shorted because their absolute value is less than or equal to 'vabsshort'.
    4 resistors are changed to resistance form because their value are less than 'rthresh'.
    Fast APS enabled.

Spectre Licensing Information:
Spectre [03:19:01.355249] Periodic Lic check successful


Notice from spectre.
    Multithreading enabled: 6 threads in the system with 6 available processors.

Time for parsing: CPU = 533.085 ms, elapsed = 200.679 ms.
Time accumulated: CPU = 951.785 ms, elapsed = 1.32268 s.
Peak resident memory used = 164 Mbytes.

~~~~~~~~~~~~~~~~~~~~~~
Pre-Simulation Summary
~~~~~~~~~~~~~~~~~~~~~~
   -   (Fast APS) Multi-threading. The recommended number of threads is 8, consider adding +mt=8 on command line.
~~~~~~~~~~~~~~~~~~~~~~

******************
DC Analysis `dcOp'
******************

Opening the PSF file ../psf/dcOp.dc ...
Important parameter values:
    reltol = 1e-03
    abstol(V) = 1 uV
    abstol(I) = 1 pA
    temp = 27 C
    tnom = 27 C
    tempeffects = all
    gmindc = 1 pS
    rabsshort = 1 mOhm
Trying `homotopy = gmin'.


Notice from spectre during DC analysis `dcOp'.
    GminDC = 1 pS is large enough to noticeably affect the DC solution.
        dV(top_tb.I0.I0.I33.I11.net26) = -15.5549 V
        Use the `gmin_check' option to eliminate or expand this report.


Maximum value achieved for any signal of each quantity: 
V: V(top_tb.net3) = 40 V
I: I(top_tb.I0.I2.R0.e101:bs_p1_bs_p2_flow) = 4.88 uA
Convergence achieved in 373 iterations.
DC simulation time: CPU = 1.32454 s, elapsed = 233.703 ms.
Total time required for dc analysis `dcOp': CPU = 1.3258 s, elapsed = 233.949 ms, util. = 567%.
Time accumulated: CPU = 2.29503 s, elapsed = 1.5596 s.
Peak resident memory used = 169 Mbytes.

dcOpInfo: writing operating point information to rawfile.

Opening the PSF file ../psf/dcOpInfo.info ...

***********************************************
Transient Analysis `tran': time = (0 s -> 1 us)
***********************************************

Notice from spectre during IC analysis, during transient analysis `tran'.
    GminDC = 1 pS is large enough to noticeably affect the DC solution.
        dV(top_tb.I0.I0.I33.I11.net26) = -15.5549 V
        Use the `gmin_check' option to eliminate or expand this report.

DC simulation time: CPU = 38.521 ms, elapsed = 6.51312 ms.

Notice from spectre during transient analysis `tran'.
    Output compression for transient analysis is enabled.


Opening the AMSSST2 file ../psf/psf.trn ...
Important parameter values:
    start = 0 s
    outputstart = 0 s
    stop = 1 us
    step = 1 ns
    maxstep = 20 ns
    ic = all
    useprevic = no
    skipdc = no
    reltol = 10e-03
    abstol(V) = 1 uV
    abstol(I) = 1 pA
    temp = 27 C
    tnom = 27 C
    tempeffects = all
    errpreset = liberal
    method = trapgear2
    lteratio = 3.5
    relref = sigglobal
    cmin = 0 F
    gmin = 1 pS
    rabsshort = 1 mOhm
    compression = wildcardonly


Output and IC/nodeset summary:
                 save   3       (current)
                 save   5       (voltage)

    tran: time = 25.08 ns    (2.51 %), step = 2.038 ns     (204 m%)
    tran: time = 78.73 ns    (7.87 %), step = 8.041 ns     (804 m%)
    tran: time = 125.1 ns    (12.5 %), step = 2.038 ns     (204 m%)
    tran: time = 178.7 ns    (17.9 %), step = 6.073 ns     (607 m%)
    tran: time = 226.6 ns    (22.7 %), step = 7.64 ns      (764 m%)
    tran: time = 279.7 ns      (28 %), step = 8.45 ns      (845 m%)
    tran: time = 325.1 ns    (32.5 %), step = 2.038 ns     (204 m%)
    tran: time = 380.1 ns      (38 %), step = 7.257 ns     (726 m%)
    tran: time = 435.8 ns    (43.6 %), step = 10.93 ns     (1.09 %)
    tran: time = 483.7 ns    (48.4 %), step = 10.28 ns     (1.03 %)
    tran: time = 525.1 ns    (52.5 %), step = 5.287 ns     (529 m%)
    tran: time = 583.8 ns    (58.4 %), step = 8.967 ns     (897 m%)
    tran: time = 632.1 ns    (63.2 %), step = 10.4 ns      (1.04 %)
    tran: time = 675.2 ns    (67.5 %), step = 6.538 ns     (654 m%)
    tran: time = 725.1 ns    (72.5 %), step = 4 ns         (400 m%)
    tran: time = 781 ns      (78.1 %), step = 7.667 ns     (767 m%)
    tran: time = 834.3 ns    (83.4 %), step = 11.54 ns     (1.15 %)
    tran: time = 884.1 ns    (88.4 %), step = 10.92 ns     (1.09 %)
    tran: time = 925.1 ns    (92.5 %), step = 2.582 ns     (258 m%)
    tran: time = 981.2 ns    (98.1 %), step = 7.74 ns      (774 m%)

The analog simulator has reached stop time, please use `analog -stop <new stop time>' to extend the analog stop time.
Simulation stopped via transient analysis stoptime at time 1 US
Memory Usage - Current physical: 84.4M, Current virtual: 288.2M
CPU Usage - 0.0s system + 0.1s user = 0.2s total (6.1% cpu)
xcelium> exit
Number of accepted tran steps =             526

Maximum value achieved for any signal of each quantity: 
V: V(top_tb.I0.I2.M0.m1:int_d) = 40.21 V
I: I(top_tb.V2:p) = 937.5 uA
If your circuit contains signals of the same quantity that are vastly different in size (such as high voltage circuitry combined with low voltage control circuitry), you should consider specifying global option `bin_relref=yes'.

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Post-Transient Simulation Summary
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
   -   The circuit contains signals of the voltage > 10V, consider to set highvoltage=yes to get better accuracy and convergence ability.
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~


During simulation, the CPU load for active processors is :
         0 (38.2 %)      1 (53.1 %)      2 (38.5 %)      3 (39.3 %)
         4 (39.3 %)      5 (41.3 %)     
        Total: 249.7%
Initial condition solution time: CPU = 38.821 ms, elapsed = 6.56605 ms.
Intrinsic tran analysis time:    CPU = 2.71864 s, elapsed = 463.919 ms.

**** AMSD: Mixed-Signal Activity Statistics ****
Number of A-to-D events:                     134
  Number of A-to-D events in IEs:            134
Number of D-to-A events:                      32
  Number of D-to-A events in IEs:             32
Number of VHDL-AMS Breaks:                     0
Number of direct digital accesses:               0

**** AMSD: IE Additional Activity Statistics ****
Number of IEs with D-to-A X edge:                    1
Number of IEs with D-to-A Z edge:                    6
Number of IEs with A-to-D X edge:                    0
Number of IEs with A-to-D Z edge:                    0
IE with max number of D-to-A edges:                 25
   top_tb.I0.\out[2]__L2E_2__logic 
IE with max number of A-to-D edges:                 25
   top_tb.I0.\out[2]__Bidir_2__logic 
Number of reporting IEs / total IEs:             70/70
Number of IEs with Vin/Vdd limit checked:            0

Total time required for tran analysis `tran': CPU = 2.79179 s, elapsed = 476.597 ms, util. = 586%.
Time accumulated: CPU = 5.48696 s, elapsed = 2.10535 s.
Peak resident memory used = 194 Mbytes.

finalTimeOP: writing operating point information to rawfile.

Opening the PSF file ../psf/finalTimeOP.info ...
modelParameter: writing model parameter values to rawfile.

Opening the PSF file ../psf/modelParameter.info ...
element: writing instance parameter values to rawfile.

Opening the PSF file ../psf/element.info ...
outputParameter: writing output parameter values to rawfile.

Opening the PSF file ../psf/outputParameter.info ...
Spectre Licensing Information:
Spectre Lic Summary:
[03:19:02.302336] Cdslmd servers:3000@lic08.ug.kth.se
[03:19:02.302355] Feature usage summary:
[03:19:02.302355] Virtuoso_Multi_mode_Simulation
[03:19:02.302360] Spectre_AMS_MMSIM_Lk


Aggregate audit (3:19:02 AM, Fri Feb 9, 2024):
Time used: CPU = 6.4 s, elapsed = 2.27 s, util. = 281%.
Time spent in licensing: elapsed = 1.39 s, percentage of total = 61%.
Peak memory used = 197 Mbytes.
Simulation started at: 3:19:00 AM, Fri Feb 9, 2024, ended at: 3:19:02 AM, Fri Feb 9, 2024, with elapsed time (wall clock): 2.27 s.
spectre completes with 0 errors, 2 warnings, and 15 notices.
Total License Acquisition Time : 1.39 s.
  xmsim  : License Acquisition Time -- 2e-06 s.
  spectre: License Acquisition Time -- 1.39 s.
xmsim: Memory Usage - Final: 72.6M, Peak: 85.7M, Peak virtual: 348.7M
xmsim: CPU Usage - 1.1s system + 5.9s user = 7.1s total (3.1s, 100.0% cpu)
TOOL:	xrun(64)	23.09-s002: Exiting on Feb 09, 2024 at 03:19:02 EST  (total: 00:00:12)
