xrun(64): 23.09-s002: (c) Copyright 1995-2023 Cadence Design Systems, Inc.
TOOL:	xrun(64)	23.09-s002: Started on Feb 09, 2024 at 05:35:58 EST
xrun
	-f xrunArgs
		-UNBUFFERED
		-cdslib ./cds.lib
		-errormax 50
		-status
		-nowarn DLNOHV
		-nowarn DLCLAP
		-v93
		-incdir /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/
		-ade
		-timescale 1ns/1ns
		-vtimescale 1ns/1ns
		-discipline logic
		-delay_mode None
		-novitalaccl
		-access r
		-noparamerr
		-amspartinfo ../psf/partition.info
		-rnm_partinfo
		-modelincdir /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/
		./spiceModels.scs
		./amsControlSpectre.scs
		-input ./probe.tcl
		-run
		-exit
		-xmsimargs "+amsrawdir ../psf"
		-spectre_args "-ahdllibdir /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.15/sharedData/CDS/ahdl/input.ahdlSimDB"
		-spectre_args +logstatus
		-simcompatible_ams spectre
		-name TOP.top_tb:config_sch
		-amsconnrules ConnRules_3V_full_fast
		+define+CDS_SELECT_CRS
		+define+CONNRULES_3V_FULL_FAST
		-allowredefinition
		-amsbind
		-top TOP.top_tb:schematic
		-top cds_globals
		./netlist.vams
		-f ./textInputs
			-amscompilefile "file:/home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/COUNTER_JI3/counter_stimulus/verilogams/verilog.vams lib:COUNTER_JI3 cell:counter_stimulus view:verilogams"
			-makelib TOP
			-makelib INV_HV
			-makelib D_CELLS_JI3V
			-makelib INV_LP
			-makelib IORING
			-makelib GATES_JI3V
			-makelib HV_CELLS
			-makelib IO_CELLS_JIC3V
			-endlib
		-v /home/saul/projects/XH018_mixed_ji3/test_mix/src/D_CELLS_JI3V.v
		-v /home/saul/projects/XH018_mixed_ji3/test_mix/src/VLG_PRIMITIVES.v
		./cds_globals.vams
		-l ../psf/xrun.log
		-spectre_args ++aps
file: ./netlist.vams
	module COUNTER_JI3.counter:schematic
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_ne3i_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_andio_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_opdio_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_ndtr_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_bufc_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_resp_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_ne3is_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_esd1_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.ICPC:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.PWRCUTDCPC:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_tp4_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_tsctrl_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.VDDORPADPC:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_ts4_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.BT4PC:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_anrdio_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.APR04DPC:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.APR00DPC:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_pe3i_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.VDDPADPC:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.GNDORPADPC:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.PSUBPADPC:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.GNDPADPC:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_ipdio_pc:cmos_sch
		errors: 0, warnings: 0
	module IO_CELLS_JIC3V.jio_lviodio_pc:cmos_sch
		errors: 0, warnings: 0
	module HV_CELLS.ioh_dhpw_2x100:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_dhpw_2x100_stack3:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pmbsab_40_10:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pmbsabhv_2000:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pe3isab_40_04:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pe3isabhv_2800gcr:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_d5pk:schematic
		errors: 0, warnings: 0
	module HV_CELLS.HVDD4DJ5PKFs:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_d2pk:schematic
		errors: 0, warnings: 0
	module HV_CELLS.HVDD4D2PK:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_iscrd2_4x100:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pe3isab_15_04:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pe3isabhv_1050gcr:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pmbsab_15_10:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_pmbsabhv_750:schematic
		errors: 0, warnings: 0
	module HV_CELLS.ioh_c5pk:schematic
		errors: 0, warnings: 0
	module HV_CELLS.HVD4SJD1R5PKFs:schematic
		errors: 0, warnings: 0
	module GATES_JI3V.nand2ji3v:schematic
		errors: 0, warnings: 0
	module GATES_JI3V.invrji3v:schematic
		errors: 0, warnings: 0
	module GATES_JI3V.nor2ji3v:schematic
		errors: 0, warnings: 0
	module GATES_JI3V.o2na2ji3v:schematic
		errors: 0, warnings: 0
	module GATES_JI3V.a22no2ji3v:schematic
		errors: 0, warnings: 0
	module GATES_JI3V.a2no2ji3v:schematic
		errors: 0, warnings: 0
	module GATES_JI3V.o2na3ji3v:schematic
		errors: 0, warnings: 0
	module IORING.ioring:schematic
		errors: 0, warnings: 0
	module INV_LP.inv:schematic
		errors: 0, warnings: 0
	module D_CELLS_JI3V.NA2JI3VX0:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.INJI3VX0:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.DLY2JI3VX1:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.BUJI3VX2:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.DECAP5JI3V:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.DECAP7JI3V:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.DECAP10JI3V:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.DECAP15JI3V:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.DECAP25JI3V:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.BUJI3VX1:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.DFRQJI3VX1:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.NO2JI3VX0:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.EN2JI3VX0:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.DFRQJI3VX2:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.AN22JI3VX1:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.AN21JI3VX1:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.DLY1JI3VX1:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.ON211JI3VX1:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.BUJI3VX16:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.BUJI3VX0:cmos_sch
		errors: 0, warnings: 0
	module D_CELLS_JI3V.DFRQJI3VX4:cmos_sch
		errors: 0, warnings: 0
	module INV_HV.inv_hv:schematic
		errors: 0, warnings: 0
	module TOP.top:schematic
		errors: 0, warnings: 0
	module TOP.top_tb:schematic
		errors: 0, warnings: 0
file: ./cds_globals.vams
	module worklib.cds_globals:vams
		errors: 0, warnings: 0
file: /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/COUNTER_JI3/counter_stimulus/verilogams/verilog.vams
	module COUNTER_JI3.counter_stimulus:verilogams
		errors: 0, warnings: 0
xmvlog: *W,LIBNOU: Library "/home/saul/projects/XH018_mixed_ji3/test_mix/src/D_CELLS_JI3V.v" given but not used.
xmvlog: *W,LIBNOU: Library "/home/saul/projects/XH018_mixed_ji3/test_mix/src/VLG_PRIMITIVES.v" given but not used.
xmvlog: *W,SPDUSD: Include directory /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/ given but not used.
	Total errors/warnings found outside modules and primitives:
		errors: 0, warnings: 3
xmvlog: Memory Usage - Current physical: 20.7M, Current virtual: 60.5M
xmvlog: CPU Usage - 0.0s system + 0.0s user = 0.1s total (0.1s, 41.3% cpu)
AMSD Universal Connect Module UCM is enabled.
		Caching library 'COUNTER_JI3' ....... Done
		Caching library 'D_CELLS_JI3V' ....... Done
		Caching library 'GATES_JI3V' ....... Done
		Caching library 'HV_CELLS' ....... Done
		Caching library 'INV_HV' ....... Done
		Caching library 'INV_LP' ....... Done
		Caching library 'IORING' ....... Done
		Caching library 'IO_CELLS_JIC3V' ....... Done
		Caching library 'TOP' ....... Done
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
xmelab: *N,MSFLON: Xcelium will initiate mixed signal elaboration, Reason: Verilog AMS module.
	Top level design units:
		top_tb
		cds_globals
	Discipline resolution Pass...
xmelab: *W,IHNOPT: AMS interface element optimization is disabled due to interface elements on inherited connections.
	Doing auto-insertion of connection elements...
	Connect Rules applied are:
		ConnRules_3V_full_fast
	Building instance overlay tables: .................... Done
	Using implicit TMP libraries; associated with library TOP
	Generating native compiled code:
		COUNTER_JI3.counter_stimulus:verilogams <0x79260a1b>
			streams:   2, words:  1765
		connectLib.L2E_2:module <0x56b949e6>
			streams:  15, words:  8739
		connectLib.E2L_2:module <0x7e9ff6a9>
			streams:  24, words: 12794
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                  Instances  Unique
		Modules:               1768      96
		Registers:              627     241
		Scalar wires:            76       -
		Vectored wires:          36       -
		Always blocks:          370      77
		Initial blocks:         433     121
		Cont. assignments:       36      21
		Interconnect:          2202       -
		Simulation timescale:   1ps
	Writing initial simulation snapshot: TOP.top_tb:config_sch
xmelab: Memory Usage - Final: 62.7M, Peak: 181.0M, Peak virtual: 291.8M
xmelab: CPU Usage - 0.0s system + 0.3s user = 0.3s total (0.4s, 81.4% cpu)
Loading snapshot TOP.top_tb:config_sch .................... Done
Simulating in AMS-SIE mode...
	Starting analog simulation engine...
AMSD Flexible Release Matrix --- using Spectre from installation:
    /pkg/cadence/installs/SPECTRE231/tools/bin/spectre
AMSD: Using spectre solver with arguments: -ahdllibdir /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.15/sharedData/CDS/ahdl/input.ahdlSimDB +logstatus ++aps.
xcelium> source /pkg/cadence/installs/XCELIUM2309/tools/xcelium/files/xmsimrc
xcelium> source /pkg/cadence/installs/XCELIUM2309/tools/xcelium/files/amsrc
xcelium> 
xcelium> # This is the NC-SIM(R) probe command file
xcelium> # used in the AMS-ADE integration.
xcelium> 
xcelium> 
xcelium> #
xcelium> # Database settings
xcelium> #
xcelium> if { [info exists ::env(AMS_RESULTS_DIR) ] } { set AMS_RESULTS_DIR $env(AMS_RESULTS_DIR)} else {set AMS_RESULTS_DIR "../psf"}
../psf
xcelium> database -open ams_database -into ${AMS_RESULTS_DIR} -default
Created default SHM database ams_database
xcelium> 
xcelium> #
xcelium> # Probe settings
xcelium> #
xcelium> probe -create -emptyok -database ams_database {top_tb.clk}
Created probe 1
xcelium> probe -create -emptyok -database ams_database {top_tb.enable}
Created probe 2
xcelium> probe -create -emptyok -database ams_database {top_tb.reset}
Created probe 3
xcelium> probe -create -emptyok -database ams_database {top_tb.out_l}
Created probe 4
xcelium> probe -create -emptyok -database ams_database {top_tb.out_h}
Created probe 5
xcelium> probe -create -emptyok -database ams_database {top_tb.out2}
Created probe 6
xcelium> probe -create -emptyok -database ams_database {top_tb.out1}
Created probe 7
xcelium> probe -create -emptyok -database ams_database {top_tb.out0}
Created probe 8
xcelium> probe -create -emptyok -database ams_database {top_tb.VDDHV}
Created probe 9
xcelium> probe -create -emptyok -database ams_database {top_tb.in_l}
Created probe 10
xcelium> 
xcelium> run

Spectre (R) Circuit Simulator
Version 23.1.0.305.isr3 64bit -- 13 Nov 2023
Copyright (C) 1989-2023 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence and Spectre are registered trademarks of Cadence Design Systems, Inc. All others are the property of their respective holders.

Includes RSA BSAFE(R) Cryptographic or Security Protocol Software from RSA Security, Inc.

User: saul   Host: phoenix   HostID: A0F02   PID: 24361
Memory  available: 13.8518 GB  physical: 16.6560 GB
Linux   : CentOS Linux release 7 (Core)
CPU Type: 11th Gen Intel(R) Core(TM) i7-11700K @ 3.60GHz
All processors running at 3600.0 MHz
        Socket: Processors
        0:       0,  1,  2,  3,  4,  5
        
System load averages (1min, 5min, 15min) : 7.2 %, 8.8 %, 5.5 %
HPC is enabled


Simulating `spiceModels.ams' on phoenix at 5:36:08 AM, Fri Feb 9, 2024 (process id: 24361).
Current working directory: /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.15/1/TOP:top_tb:1:1/netlist
Command line:
    /pkg/cadence/installs/SPECTRE231/tools/bin/spectre -64  \
        spiceModels.ams +config  \
        /pkg/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/configs/ams.cfg  \
        -ahdllibdir  \
        /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.15/sharedData/CDS/ahdl/input.ahdlSimDB  \
        +logstatus ++aps -raw ../psf  \
        -I/home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/  \
        +ams_control=xcelium.d/AMSD/ams_ctrl/ams_ctrl_24019_phoenix
Spectre Licensing Information:
Spectre [05:36:08.512433] Configured Lic search path (22.01-s002): 3000@lic08.ug.kth.se

Spectre Licensing Information:
Spectre [05:36:08.204041] Periodic Lic check successful

Loading /pkg/cadence/installs/SPECTRE231/tools.lnx86/cmi/lib/64bit/5.0/libinfineon_sh.so ...
Loading /pkg/cadence/installs/SPECTRE231/tools.lnx86/cmi/lib/64bit/5.0/libphilips_I_sh.so ...
Loading /pkg/cadence/installs/SPECTRE231/tools.lnx86/cmi/lib/64bit/5.0/libphilips_sh.so ...
Loading /pkg/cadence/installs/SPECTRE231/tools.lnx86/cmi/lib/64bit/5.0/libsparam_sh.so ...
Loading /pkg/cadence/installs/SPECTRE231/tools.lnx86/cmi/lib/64bit/5.0/libstmodels_sh.so ...
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.15/1/TOP:top_tb:1:1/netlist/spiceModels.ams

Notice from spectre during circuit read-in.
    Configuration file used: `/pkg/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/configs/ams.cfg'.

Reading link:  /pkg/cadence
Reading file:  /home/saul/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/configs/spectre.cfg
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.15/sharedData/CDS/ahdl/input.ahdlSimDB/connectLib__E2L_2__module__0x10000001_behavioral.flex.va
Reading file:  /home/saul/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/ahdl/constants.vams
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.15/sharedData/CDS/ahdl/input.ahdlSimDB/connectLib__L2E_2__module__0x10000001_behavioral.flex.va
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.15/1/TOP:top_tb:1:1/netlist/spiceModels.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/config.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/param.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/bip.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/tm_bip.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpva.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpva3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvb3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvc3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnva.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvb_npn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvb_pnp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvc_npn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvc_pnp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvhscr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvascr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpvhbscr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvba.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvba_npn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvba_pnp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvca.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvca_npn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnvca_pnp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpv_pa.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpv_pb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpv_pc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpv_pd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpv_pe.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpv_pf.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpl_pa.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpl_pb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpl_pc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpl_pd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpl_pe.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qpl_pf.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnl_pa.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnl_pb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnl_pc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnl_pd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnl_pe.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/bip/qnl_pf.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/cap.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/tm_cap.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csandwt3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csandwt4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csandwt5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf2p.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf3p.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csft4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csft5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csft6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf3a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf4a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csf5a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csft4a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csft5a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/csft6a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cif3a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cif4a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cif5a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cift4a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cift5a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cift6a.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmm3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmm4t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmm4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmm5t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmm6t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cdmm4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cdmm4t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/ctmm5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/ctmm5t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmmh3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmmh4t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmmh4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmmh5t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cmmh6t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cdmmh4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cdmmh4t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/ctmmh5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/ctmmh5t.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc_pmos.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvci.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvci_nmos.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvci_m.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc3_pmos.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc3i.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc3i_nmos.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/mosvc3i_m.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cpod.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cpod_i.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cpodhv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cpodhv_i.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cp1sub.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cp1suba.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/cp1subp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/tag_25v.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/cap/tag_60v.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/dio.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/tm_dio.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dn3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnn3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dp3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnw3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/ddnwmv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpdnwmv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dipdnwmv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/ddnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpdnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dipdnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnhpw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnhpwa.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dphnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dphnwa.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dhpw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dhnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dndf.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpdwhn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dwhn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpwhn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpndf.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpdddnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/ddpldnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dn3dpl.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dbn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpol.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnpdd_scr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpdd_scr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dsb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dsba.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dsba_qp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dnp20.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dpp20.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dn3sci.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/dio/dscidnwmv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/mos.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/tm_mos.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nei.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nei_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nei_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pei.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pei_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pei_m_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nel.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/neli.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/neli_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/neli_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pel.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pel_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/peli.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/peli_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/peli_m_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nn3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3i.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3i_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3i_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3i.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3i_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3i_m_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3ln.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3ln_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lni.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lni_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lni_m_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3_mos1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3i.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3i_mos1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3i_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3i_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nd3i_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nelna.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nelnai.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nelnai_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nelnai_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3lna.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3lnai.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3lnai_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ne3lnai_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lna.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lna_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lnai.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lnai_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pe3lnai_m_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmma.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/jf_nmma.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmma_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmma.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/jf_pmma.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmma_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nedi.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nedi_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nedia.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nedia_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ped2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ped2_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ped.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/ped_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhv_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhv_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhhv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhhv_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhhv_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmmc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmmc_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmmc_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmmd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmmd_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmmd_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmc_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nmc_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nma.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nma_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/phv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/phv_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/phv_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/phhv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/phhv_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/phhv_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmc_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmc_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmmc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmmc_mos2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmmc_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pma.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pma_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pmb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nesvt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nesvti.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nesvti_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nesvti_m_6.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pesvt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pesvt_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pesvti.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pesvti_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/pesvti_m_5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhvd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhvd_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhhvd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/mos/nhhvd_bjt.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/photo.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/tm_pho.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphoa.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dpho.va
Reading link:  /pkg/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/ahdl/constants.h
Reading link:  /pkg/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/ahdl/discipline.h
Reading file:  /home/saul/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/ahdl/disciplines.vams
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphob.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphoc.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/iphoto_uv.va
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphoc_cat.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphoc0.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphoc0_cat.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphocfp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphocfp_cat.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphod.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphod_an1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphod_an2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphod0.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphod0_an1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphod0_an2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphodfp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphodfp_an1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dphodfp_an2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspada0.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/ispad.va
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/iphoto_apd_trig.va
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapb_jun.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapb_trig.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapb0.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapb0_jun.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspb.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/ispad_trig.va
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspb_jun.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspb_trig.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspb0.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspb0_jun.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspbfep.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapda.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/iphoto_apd.va
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapda_cat.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dapda0.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspada.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/photo/dspada_cat.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/res.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/tm_res.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdn_esd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdp_io.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdp_esd.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnw.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnw_scr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdn3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdp3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnw3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnw3_scr.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rdnwmv.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnp1_3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rpp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rpp1_3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rpp1s.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rpp1s_3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnp1h.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rnp1h_3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rpp1k1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rpp1k1_3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rctdn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rctdp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rctp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsildn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsildp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsilnp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsilpp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbdn.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbdp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbdn3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbdp3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbnp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbpp1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rsbpp1k1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rm1.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rm2.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rm3.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rm4.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rm5.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rmtp.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/rmtpl.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/pfuse.scs
Reading file:  /home/saul/pkg/xfab/XKIT/xh018/cadence/v9_0/spectre/v9_0_2/lpmos/models/res/s_res.scs
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.15/1/TOP:top_tb:1:1/netlist/amsControlSpectre.scs
Reading file:  /home/saul/projects/XH018_mixed_ji3/test_mix/virtuoso/Sim/TOP/top_tb/adexl/results/data/Interactive.15/1/TOP:top_tb:1:1/netlist/.amsbind.scs
Reading file:  /home/saul/cadence/installs/SPECTRE231/tools.lnx86/spectre/etc/configs/ams.cfg
Time for NDB Parsing: CPU = 196.683 ms, elapsed = 560.413 ms.
Time accumulated: CPU = 244.31 ms, elapsed = 560.416 ms.
Peak resident memory used = 121 Mbytes.

Existing shared object for module connectLib__L2E_2__module__0x10000001_behavioral is up to date.
Installed compiled interface for connectLib__L2E_2__module__0x10000001_behavioral.
Existing shared object for module connectLib__E2L_2__module__0x10000001_behavioral_c1_0_c2_0_c0_1 is up to date.
Installed compiled interface for connectLib__E2L_2__module__0x10000001_behavioral_c1_0_c2_0_c0_1.
Existing shared object for module bsource_d40369 is up to date.
Installed compiled interface for bsource_d40369.
Existing shared object for module bsource_9babe2 is up to date.
Installed compiled interface for bsource_9babe2.
Existing shared object for module bsource_rdn3mod_dc4281 is up to date.
Installed compiled interface for bsource_rdn3mod_dc4281.
Existing shared object for module bsource_ee103d is up to date.
Installed compiled interface for bsource_ee103d.
Existing shared object for module bsource_b7022a is up to date.
Installed compiled interface for bsource_b7022a.
Existing shared object for module bsource_rdp3mod_aaacb8 is up to date.
Installed compiled interface for bsource_rdp3mod_aaacb8.
Existing shared object for module bsource_d312da is up to date.
Installed compiled interface for bsource_d312da.
Existing shared object for module bsource_cf985e is up to date.
Installed compiled interface for bsource_cf985e.
Existing shared object for module bsource_rpp1k1_3mod_29a82c is up to date.
Installed compiled interface for bsource_rpp1k1_3mod_29a82c.
Time for Elaboration: CPU = 141.928 ms, elapsed = 156.254 ms.
Time accumulated: CPU = 386.304 ms, elapsed = 716.735 ms.
Peak resident memory used = 148 Mbytes.


Notice from spectre during hierarchy flattening.
    The value 'psf' specified for the 'checklimitdest' option will no longer be supported in future releases. Use 'spectre -h' to see other recommended values for the 'checklimitdest' option.


Time for EDB Visiting: CPU = 130.923 ms, elapsed = 130.924 ms.
Time accumulated: CPU = 517.323 ms, elapsed = 847.753 ms.
Peak resident memory used = 172 Mbytes.


Warning from spectre during initial setup.
    WARNING (CMI-2318): top_tb.I0.I0.I24.I11.I5.MP_1_turbo_m70.MPX.m1: Parasitic resistor `rs' has been deleted because its value of 626.786 uOhm ( R / MFactor ) was smaller than `minr'.
    WARNING (CMI-2318): top_tb.I0.I0.I24.I11.I5.MP_1_turbo_m70.MPX.m1: Parasitic resistor `rd' has been deleted because its value of 626.786 uOhm ( R / MFactor ) was smaller than `minr'.
Notice from spectre during initial setup.
    top_tb.I0.I2.M0.nediamod: Hisim_hv version 2.10 used. Version: 2, Subversion: 1 and Revision: 0. Type is N.
Notice from spectre during topology check.
    No connections to node `vdd3i!'.
    No connections to node `gnd3i!'.
    No DC path from node `vdd3i!' to ground, Gmin installed to provide path.
    No DC path from node `gnd3i!' to ground, Gmin installed to provide path.


Global user options:
               temp = 27
            vabstol = 1e-06
            iabstol = 1e-12
               gmin = 1e-12
             rforce = 1
           maxnotes = 5
           maxwarns = 5
             digits = 5
             pivrel = 0.001
     checklimitdest = psf
               save = selected
               tnom = 27
              scale = 1
             scalem = 1
             reltol = 0.001

Scoped user options:

Circuit inventory:
              nodes 18433
            bsim3v3 2181  
     bsource_9babe2 416   
     bsource_b7022a 593   
     bsource_cf985e 1     
     bsource_d312da 1     
     bsource_d40369 416   
     bsource_ee103d 593   
bsource_rdn3mod_dc4281 832   
bsource_rdp3mod_aaacb8 1186  
bsource_rpp1k1_3mod_29a82c 2     
          capacitor 54    
connectLib__L2E_2__module__0x10000001_behavioral 3     
              diode 5545  
           hisim_hv 1     
          juncap200 5545  
           resistor 15495 
            vsource 11    
connectLib__E2L_2__module__0x10000001_behavioral 33    

Analysis and control statement inventory:
                 dc 1     
               info 4     

Output statements:
             .probe 0     
           .measure 0     
               save 11    


Notice from spectre during initial setup.
    7 vsources are shorted because their absolute value is less than or equal to 'vabsshort'.
    4 resistors are changed to resistance form because their value are less than 'rthresh'.
    Fast APS enabled.

Spectre Licensing Information:
Spectre [05:36:09.485714] Periodic Lic check successful


Notice from spectre.
    Multithreading enabled: 6 threads in the system with 6 available processors.

Time for parsing: CPU = 752.32 ms, elapsed = 321.809 ms.
Time accumulated: CPU = 1.26975 s, elapsed = 1.16967 s.
Peak resident memory used = 191 Mbytes.

~~~~~~~~~~~~~~~~~~~~~~
Pre-Simulation Summary
~~~~~~~~~~~~~~~~~~~~~~
   -   (Fast APS) Multi-threading. The recommended number of threads is 8, consider adding +mt=8 on command line.
~~~~~~~~~~~~~~~~~~~~~~

******************
DC Analysis `dcOp'
******************

Opening the PSF file ../psf/dcOp.dc ...
Important parameter values:
    reltol = 1e-03
    abstol(V) = 1 uV
    abstol(I) = 1 pA
    temp = 27 C
    tnom = 27 C
    tempeffects = all
    gmindc = 1 pS
    rabsshort = 1 mOhm
Trying `homotopy = gmin'.


Notice from spectre during DC analysis `dcOp'.
    GminDC = 1 pS is large enough to noticeably affect the DC solution.
        dV(top_tb.I0.I0.I33.I11.net26) = -15.5581 V
        Use the `gmin_check' option to eliminate or expand this report.
    Bad pivoting is found during DC analysis. Option dc_pivot_check=yes is recommended for possible improvement of convergence.


Maximum value achieved for any signal of each quantity: 
V: V(top_tb.net3) = 40 V
I: I(top_tb.I0.I2.R0.e101:bs_p1_bs_p2_flow) = 4.88 uA
Convergence achieved in 2 iterations.
DC simulation time: CPU = 5.21934 s, elapsed = 879.635 ms.
Total time required for dc analysis `dcOp': CPU = 5.22139 s, elapsed = 879.976 ms, util. = 593%.
Time accumulated: CPU = 6.5115 s, elapsed = 2.05304 s.
Peak resident memory used = 197 Mbytes.

dcOpInfo: writing operating point information to rawfile.

Opening the PSF file ../psf/dcOpInfo.info ...
modelParameter: writing model parameter values to rawfile.

Opening the PSF file ../psf/modelParameter.info ...
element: writing instance parameter values to rawfile.

Opening the PSF file ../psf/element.info ...
outputParameter: writing output parameter values to rawfile.

Opening the PSF file ../psf/outputParameter.info ...
Simulation complete via transient analysis stoptime at time 0 FS
Memory Usage - Current physical: 86.0M, Current virtual: 225.9M
CPU Usage - 0.1s system + 0.2s user = 0.3s total (9.2% cpu)
xcelium> exit
Spectre Licensing Information:
Spectre Lic Summary:
[05:36:10.233267] Cdslmd servers:3000@lic08.ug.kth.se
[05:36:10.233392] Feature usage summary:
[05:36:10.233392] Virtuoso_Multi_mode_Simulation
[05:36:10.233393] Spectre_AMS_MMSIM_Lk


Aggregate audit (5:36:10 AM, Fri Feb 9, 2024):
Time used: CPU = 8.64 s, elapsed = 2.44 s, util. = 353%.
Time spent in licensing: elapsed = 676 ms, percentage of total = 27.7%.
Peak memory used = 218 Mbytes.
Simulation started at: 5:36:08 AM, Fri Feb 9, 2024, ended at: 5:36:10 AM, Fri Feb 9, 2024, with elapsed time (wall clock): 2.44 s.
spectre completes with 0 errors, 2 warnings, and 14 notices.
Total License Acquisition Time : 0.676 s.
  xmsim  : License Acquisition Time -- 2e-06 s.
  spectre: License Acquisition Time -- 0.676 s.
xmsim: Memory Usage - Final: 83.2M, Peak: 86.2M, Peak virtual: 225.9M
xmsim: CPU Usage - 1.5s system + 8.1s user = 9.6s total (3.6s, 100.0% cpu)
TOOL:	xrun(64)	23.09-s002: Exiting on Feb 09, 2024 at 05:36:10 EST  (total: 00:00:12)
